/*
 메소드 오버로딩(overloading) 작성 규칙에 대한 3가지 기술
 1. 메소드의 이름이 같아야한다.
 2. 매개변수의 자료형이 달라야 한다.
 3. 매개변수의 개수가 달라야한다.
 4. 매개변수의 순서가 달라야한다.
 
 다음 두 클래스의 차이점을 확인해보자.
 (1) public class 클래스명 { }
 	- 자바 소스 파일 내에 1개만 존재할 수 있는 클래스
 	- 자바 소스 파일명과 같은 이름으로 지정하며, 해당 소스를 대표하는 클래스
 	- 주로 주요 동작에 대한 내용을 작성하며, 소스 파일 Run 실행 시 해당 클래스를 우선으로 찾아 동작을 수행한다.
 	
 (2) class 클래스명 { }
 	- 소스파일 내에 여러 개를 생성 할 수 있는 클래스
 	- 주로 객체를 생성하여 사용하는 참조 클래스 형식으로 사용한다.
 	- 주요 동작에 대한 내용을 작성하여 Run As로 설정하여 실행 할 수 있다.
 */

package study_0530;

public class Method_overloading_9 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
